In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('stud.csv')

## Ans1
-Five five functions of the pandas library with execution.

In [4]:
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
df.describe()

       math_score  reading_score  writing_score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [6]:
df.shape

(1000, 8)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race_ethnicity               1000 non-null   object
 2   parental_level_of_education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test_preparation_course      1000 non-null   object
 5   math_score                   1000 non-null   int64
 6   reading_score                1000 non-null   int64
 7   writing_score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [8]:
df.tail()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## Ans2

In [9]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

In [10]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [11]:
def reindex_df(df):
    new_index = pd.Index(range(1, 2*len(df)+1, 2))
    return df.set_index(new_index)

In [12]:
new_df = reindex_df(df)

In [13]:
new_df

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

## Ans3

In [18]:
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})

In [19]:
df

   Values
0      10
1      20
2      30
3      40
4      50

In [20]:
def sum_first_three(df):
    total = 0
    for i in range(3):
        total += df.at[i, 'Values']
    print(total)

In [21]:
sum_first_three(df)

60

## Ans4

In [22]:
df = pd.DataFrame({'Text': ['This is a test', 'Another test', 'A third test']})

In [23]:
df

             Text
0  This is a test
1    Another test
2    A third test

In [24]:
def add_word_count(df):
    df['Word_Count'] = df['Text'].apply(lambda x: len(x.split()))
    return df

In [25]:
new_df = add_word_count(df)

In [26]:
new_df

             Text  Word_Count
0  This is a test           4
1    Another test           2
2    A third test           3

## Ans5

- The size property returns the number of elements in the DataFrame. The number of elements is the number of rows * the number of columns.
- shape attribute in Pandas enables us to obtain the shape of a DataFrame. For example, if a DataFrame has a shape of (80, 10) , this implies that the DataFrame is made up of 80 rows and 10 columns of data.

In [29]:
df.size

6

In [30]:
df.shape

(3, 2)

## Ans6

- we use read_csv() function to read csv file in pandas

## Ans7

In [31]:
df = pd.DataFrame({'Email': ['johndoe@gmail.com', 'janedoe@yahoo.com', 'bobsmith@hotmail.com']})

In [32]:
df

                  Email
0     johndoe@gmail.com
1     janedoe@yahoo.com
2  bobsmith@hotmail.com

In [35]:
def extract_username(df):
    df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])
    return df

In [37]:
new_df = extract_username(df)

In [38]:
new_df

                  Email  Username
0     johndoe@gmail.com   johndoe
1     janedoe@yahoo.com   janedoe
2  bobsmith@hotmail.com  bobsmith

## Ans8

In [39]:
df = pd.DataFrame({'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]})

In [40]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [41]:
def select_rows(df):
    selected_df = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_df

In [42]:
selected_df = select_rows(df)

In [43]:
selected_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Ans9

In [44]:
df = pd.DataFrame({'Values': [1, 2, 3, 4, 5]})

In [45]:
def calculate_stats(df):
    mean_val = df['Values'].mean()
    median_val = df['Values'].median()
    std_val = df['Values'].std()
    print('Mean:', mean_val)
    print('Median:', median_val)
    print('Standard Deviation:', std_val)

In [46]:
calculate_stats(df)

Mean: 3.0
Median: 3.0
Standard Deviation: 1.5811388300841898

## Ans10

In [47]:
df = pd.DataFrame({'Date': pd.date_range('2022-01-01', periods=14), 'Sales': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]})

In [48]:
df

         Date  Sales
0  2022-01-01      1
1  2022-01-02      2
2  2022-01-03      3
3  2022-01-04      4
4  2022-01-05      5
5  2022-01-06      6
6  2022-01-07      7
7  2022-01-08      8
8  2022-01-09      9
9  2022-01-10     10
10 2022-01-11     11
11 2022-01-12     12
12 2022-01-13     13
13 2022-01-14     14

In [49]:
def calculate_moving_average(df):
    window_size = 7
    moving_average = df['Sales'].rolling(window_size, min_periods=1).mean()
    df['MovingAverage'] = moving_average
    return df

In [50]:
df = calculate_moving_average(df)

In [51]:
df

         Date  Sales  MovingAverage
0  2022-01-01      1            1.0
1  2022-01-02      2            1.5
2  2022-01-03      3            2.0
3  2022-01-04      4            2.5
4  2022-01-05      5            3.0
5  2022-01-06      6            3.5
6  2022-01-07      7            4.0
7  2022-01-08      8            5.0
8  2022-01-09      9            6.0
9  2022-01-10     10            7.0
10 2022-01-11     11            8.0
11 2022-01-12     12            9.0
12 2022-01-13     13           10.0
13 2022-01-14     14           11.0

## Ans11

In [52]:
df = pd.DataFrame({'Date': pd.date_range('2023-01-01', periods=5)})

In [53]:
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [55]:
def add_weekday_column(df):
    df['Weekday'] = df['Date'].dt.strftime('%A')
    return df

In [56]:
df = add_weekday_column(df)

In [57]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

## Ans12

In [64]:
df = pd.DataFrame({'Date': pd.date_range('2023-04-17', periods=10, freq='D')})

In [65]:
df

        Date
0 2023-04-17
1 2023-04-18
2 2023-04-19
3 2023-04-20
4 2023-04-21
5 2023-04-22
6 2023-04-23
7 2023-04-24
8 2023-04-25
9 2023-04-26

In [67]:
def select_April(df):
    start_date = pd.Timestamp('2023-04-18')
    end_date = pd.Timestamp('2023-04-25')
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    return df.loc[mask]

In [68]:
df_April = select_April(df)

In [69]:
df_April

        Date
1 2023-04-18
2 2023-04-19
3 2023-04-20
4 2023-04-21
5 2023-04-22
6 2023-04-23
7 2023-04-24
8 2023-04-25

## Ans13

- The first and foremost necessary library that needs to be imported to use the basic functions of pandas is pandas itself.